Autodesk.Navisworks.Api.PrimitiveTypes
Different types of primitive used to define geometry

Autodesk.Navisworks.Api.PrimitiveTypes.None
No primitives

Autodesk.Navisworks.Api.PrimitiveTypes.Triangles
Includes triangle primitives

Autodesk.Navisworks.Api.PrimitiveTypes.Lines
Includes line primitives

Autodesk.Navisworks.Api.PrimitiveTypes.Points
Includes point primitives

Autodesk.Navisworks.Api.PrimitiveTypes.SnapPoints
Includes snap point primitives

Autodesk.Navisworks.Api.PrimitiveTypes.Text
Includes text primitives